Lazarus/httpFolderPoster/inputFolder/Pattern9.xml

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 8/8/2012 4:34:49 PM: Generated with wsdlStub 4.2.0.2622 by Jan -->
<soapenv:Envelope
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 >
  <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <ns4:RaboHeader xmlns:ns4="http://www.rabobank.nl/XMLHeader/10">
      <ns4:HeaderVersion>HeaderVersion</ns4:HeaderVersion>
      <ns4:MessageId>MessageId</ns4:MessageId>
      <ns4:ServiceRequestorDomain>ServiceRequestorDomain</ns4:ServiceRequestorDomain>
      <ns4:ServiceRequestorId>ServiceRequestorId</ns4:ServiceRequestorId>
      <ns4:ServiceProviderDomain>ServiceProviderDomain</ns4:ServiceProviderDomain>
      <ns4:ServiceId>ServiceId</ns4:ServiceId>
      <ns4:ServiceVersion>Ser</ns4:ServiceVersion>
      <ns4:FaultIndication>False</ns4:FaultIndication>
      <ns4:MessageTimestamp>2010-12-11T13:30:00.200000</ns4:MessageTimestamp>
    </ns4:RaboHeader>
    <wsa:Action>process</wsa:Action>
    <wsa:From>
      <wsa:Address>http://JANBO:0</wsa:Address>
    </wsa:From>
    <wsa:MessageID>uuid:3148-8db6-3fc6-79a1</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://JANBO:0</wsa:Address>
    </wsa:ReplyTo>
    <wsa:To>queue//getWsaTo_not_yet_implemented</wsa:To>
  </soapenv:Header>
  <soapenv:Body>
    <ns1:RaadplegenServiceAanvraag_Req xmlns:ns1="http://www.rabobank.nl/CRM/CRMI/RaadplegenServiceAanvraag/1/Req">
      <ns1:ServiceAanvraagStatusFilter>ServiceAanvraagStatusFilter</ns1:ServiceAanvraagStatusFilter>
      <ns1:ActiviteitStatusFilter>ActiviteitStatusFilter</ns1:ActiviteitStatusFilter>
      <ns1:KlantenLijst>
        <ns1:Klant>
          <ns1:KlantId>KlantId</ns1:KlantId>
        </ns1:Klant>
      </ns1:KlantenLijst>
    </ns1:RaadplegenServiceAanvraag_Req>
  </soapenv:Body>
</soapenv:Envelope>
